#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
tls_private_key.pk: Refreshing state... [id=8ffe73e3007c5f0c0e7f13adcb71f93411418205]
data.aws_ami.ubuntu: Reading...
data.aws_availability_zones.myApp: Reading...
aws_key_pair.pk: Refreshing state... [id=myKey]
aws_default_vpc.myApp: Refreshing state... [id=vpc-01e31438478a7b4a0]
aws_s3_bucket.test_bucket: Refreshing state... [id=my-test-random-bucket-a-a-a]
data.aws_availability_zones.myApp: Read complete after 0s [id=eu-west-2]
aws_default_subnet.default_az1: Refreshing state... [id=subnet-0e2c4c58a10c41418]
aws_default_subnet.default_az2: Refreshing state... [id=subnet-0163d1462d6e2dc84]
local_file.pk: Refreshing state... [id=1752b4585cf86458d89cdec4db9cd9558027a420]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0f321d890424a6390]
aws_security_group.myApp: Refreshing state... [id=sg-050453a0b01f70b80]
aws_instance.myAppone: Refreshing state... [id=i-06057a2eb68388a66]
aws_instance.myAppthree: Refreshing state... [id=i-0a124f9e20a57e4e4]
aws_instance.myAppTwo: Refreshing state... [id=i-0404996953fcc90e9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.myAppfour will be created
  + resource "aws_instance" "myAppfour" {
      + ami                                  = "ami-0f321d890424a6390"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "myKey"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "eu-west-2"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0e2c4c58a10c41418"
      + tags                                 = {
          + "Name" = "myAppfour"
        }
      + tags_all                             = {
          + "Name" = "myAppfour"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-050453a0b01f70b80",
        ]
    }

  # local_file.pk will be created
  + resource "local_file" "pk" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "myKey.pem"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @daveacho, Action: `pull_request`, Workflow: `Terraform Apply and Destroy`*